Config/Catalogs/Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Периоды/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция возвращает период, смещенный относительно заданного на Смещение.
//
// Параметры:
//	локПериодОтчета - исходный период;
//	Смещение - число, смещение относительно исходного периода. Знак определяет направление смещения.
//
// Результат:
//	СправочникСсылка.Периоды - период, смещенный от исходного на Смещение.
//
Функция ОтносительныйПериод(ДатаНачала, Периодичность, Смещение = 0) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ВызватьИсключение НСтр("ru = '""Дата начала не задан.""'");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		ВызватьИсключение НСтр("ru = '""Исходая периодичность не задана.""'");
	КонецЕсли;
		
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Если Периодичность = мПериодичность.Год 
		ИЛИ Периодичность = мПериодичность.ДевятьМесяцев Тогда 
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ДатаНачала, 12 * Смещение);
		
	ИначеЕсли Периодичность = мПериодичность.Полугодие Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ДатаНачала, 6 * Смещение);
		
	ИначеЕсли Периодичность = мПериодичность.Квартал Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ДатаНачала, 3 * Смещение);
		
	ИначеЕсли Периодичность = мПериодичность.Месяц Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ДатаНачала, Смещение);
		
	ИначеЕсли Периодичность = мПериодичность.Декада Тогда
		
		// анализируем
		Если День(ДатаНачала) < 11 Тогда 
			НомерДекадыМесяца = 1;
			
		ИначеЕсли День(ДатаНачала) < 21 Тогда 
			НомерДекадыМесяца = 2;
			
		Иначе 
			НомерДекадыМесяца = 3;
		КонецЕсли;
		
		НомерДекадыНЭ						= Год(ДатаНачала) * 36 + (Месяц(ДатаНачала) - 1) * 3 + (НомерДекадыМесяца - 1);
		
		// изменяем
		НомерДекадыНЭ						= НомерДекадыНЭ + Смещение;
		
		// синтезируем
		ГодДатыНачалаОтнПериода				= Цел((НомерДекадыНЭ)/ 36);
		ДекадаВГоду							= НомерДекадыНЭ % 36;
		МесяцВГодуДатыНачалаОтнПериода		= Цел(ДекадаВГоду / 3) + 1;
		ДекадаВМесяце						= ДекадаВГоду % 3;
		ДеньВМесяцеДатыНачалаОтнПериода		= ДекадаВМесяце * 10 + 1;
		
		ДатаНачалаОтносительногоПериода		= Дата(ГодДатыНачалаОтнПериода, МесяцВГодуДатыНачалаОтнПериода, ДеньВМесяцеДатыНачалаОтнПериода);
		
	ИначеЕсли Периодичность = мПериодичность.День Тогда
		ДатаНачалаОтносительногоПериода = ДатаНачала + 86400 * Смещение;
		
	Иначе
		Шаблон = НСтр(
		"ru = 'Смещение для периодичности ""%1"" не поддерживается'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Периодичность);
		ВызватьИсключение Сообщение;
		
	КонецЕсли;
	
	ДатаНачалаОтносительногоПериода = НачалоДня(ДатаНачалаОтносительногоПериода);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтносительногоПериода);
	Запрос.УстановитьПараметр("Периодичность", Периодичность);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Периоды.Ссылка
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала = &ДатаНачала
	|	И Периоды.Периодичность = &Периодичность";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Шаблон = НСтр(
		"ru = 'Не существует периода с периодичностью ""%1"" и датой начала ""%2""  в справочнике ""Периоды"".'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Периодичность, ДатаНачалаОтносительногоПериода);
		
		ВызватьИсключение Сообщение;
	КонецЕсли;	
	
КонецФункции

// Функция выполняет создание дочерних периодов по родителю
// 
Функция СоздатьПериоды(ЗаполняемыеПериоды, Ссылка) Экспорт
	
	//Если ЭтоНовый() Тогда
	Если Ссылка.Пустая() Тогда	
		Сообщить("Для генерации периодов элемент необходимо записать.",СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗаполняемыеПериоды.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Периоды.Ссылка КАК Ссылка,
	             |	Периоды.ДатаНачала КАК ДатаНачала,
	             |	Периоды.Периодичность КАК Периодичность
	             |ИЗ
	             |	Справочник.Периоды КАК Периоды
	             |ГДЕ
	             |	Периоды.Родитель В ИЕРАРХИИ(&Родитель)
	             |	И Периоды.Периодичность В(&Периодичность)";
				 
	Запрос.УстановитьПараметр("Родитель",Ссылка);
	Запрос.УстановитьПараметр("Периодичность",ЗаполняемыеПериоды);
	
	Результат=Запрос.Выполнить().Выгрузить();
	
	Для Каждого Периодичность ИЗ ЗаполняемыеПериоды Цикл
		
		локДатаНачала = Ссылка.ДатаНачала;
		
		Пока локДатаНачала <= Ссылка.ДатаОкончания Цикл
			
			СтруктураПоиска=Новый Структура;
			СтруктураПоиска.Вставить("ДатаНачала",локДатаНачала);
			СтруктураПоиска.Вставить("Периодичность",Периодичность);
			
			МассивСуществующих=Результат.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСуществующих.Количество()=0 Тогда
				
				Объект = Справочники.Периоды.СоздатьЭлемент();
				Объект.Родитель   = Ссылка;
				Объект.ДатаНачала = локДатаНачала;
				Объект.Периодичность = Периодичность;
				ЗаполнитьРеквизитыОбъекта(Объект);
				
				Объект.ОбменДанными.Загрузка=Истина;
				
				Попытка
					Объект.Записать();
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
				
				СсылкаПериода = Объект.Ссылка;
				
			Иначе
				
				СсылкаПериода = МассивСуществующих[0].Ссылка;
				
			КонецЕсли; 
			
			Если Периодичность = мПериодичность.ДевятьМесяцев Тогда
				Прервать;
			Иначе
				локДатаНачала = НачалоДня(ДобавитьДень(СсылкаПериода.ДатаОкончания, 1));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	РеструктурироватьПериоды(Ссылка);
	
	Возврат Истина;
	
КонецФункции

Процедура РеструктурироватьПериоды(локРодитель = Неопределено) Экспорт
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Периоды.Ссылка КАК Период,
	|	Периоды.Родитель КАК Родитель,
	|	ВложенныйЗапрос.Ссылка КАК ПериодРодитель,
	|	ВложенныйЗапрос.РазностьДат КАК РазностьДат
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Периоды.Ссылка КАК Ссылка,
	|			Периоды.ДатаНачала КАК ДатаНачала,
	|			Периоды.ДатаОкончания КАК ДатаОкончания,
	|			Периоды.Периодичность КАК Периодичность,
	|			РАЗНОСТЬДАТ(Периоды.ДатаНачала, Периоды.ДатаОкончания, ДЕНЬ) КАК РазностьДат
	|		ИЗ
	|			Справочник.Периоды КАК Периоды
	|		ГДЕ
	|			(НЕ Периоды.Произвольный)
	|			И (НЕ Периоды.ПометкаУдаления)
	|			И (НЕ Периоды.Периодичность=&ДевятьМесяцев)
	|"+?(НЕ локРодитель=Неопределено,"И Периоды.Ссылка В ИЕРАРХИИ(&Родитель)","")+") КАК ВложенныйЗапрос
	|		ПО Периоды.ДатаНачала >= ВложенныйЗапрос.ДатаНачала
	|			И Периоды.ДатаОкончания <= ВложенныйЗапрос.ДатаОкончания
	|			И Периоды.Периодичность <> ВложенныйЗапрос.Периодичность
	|ГДЕ
	|	(НЕ Периоды.Произвольный)
	|	И (НЕ Периоды.ПометкаУдаления)
	|	И (НЕ ВложенныйЗапрос.Ссылка ЕСТЬ NULL )
	|"+?(НЕ локРодитель=Неопределено,"И Периоды.Ссылка В ИЕРАРХИИ(&Родитель)","")+"
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	РазностьДат
	|;
	|////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Ссылка КАК Период,
	|	Периоды.Родитель КАК Родитель
	|ИЗ 
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.Ссылка = Периоды.Родитель"; 
	
	Запрос.УстановитьПараметр("Родитель",локРодитель);
	Запрос.УстановитьПараметр("ДевятьМесяцев",мПериодичность.ДевятьМесяцев);
	
	ТекПериод = Неопределено;
	
	РезультатыПакета = Запрос.ВыполнитьПакет();
	Выборка = РезультатыПакета[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Период = ТекПериод Тогда
			
			ТекПериод=Выборка.Период;
			
			Если НЕ Выборка.Родитель = Выборка.ПериодРодитель Тогда
				
				ПериодОбъект = Выборка.Период.ПолучитьОбъект();
				
				ПериодОбъект.Родитель = Выборка.ПериодРодитель;
				ПериодОбъект.ОбменДанными.Загрузка = Истина;
				ПериодОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаЗацикленных = РезультатыПакета[1].Выбрать();
	
	Пока ВыборкаЗацикленных.Следующий() Цикл
		ПериодОбъект = ВыборкаЗацикленных.Период.ПолучитьОбъект();
		ПериодОбъект.Родитель = Справочники.Периоды.ПустаяСсылка();
		ПериодОбъект.ОбменДанными.Загрузка = Истина;
		ПериодОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры // РеструктурироватьПериоды()

// Определяет значения взаимосвязанных реквизитов при заполнении справочника
//
Процедура ЗаполнитьРеквизитыОбъекта(Объект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
			Возврат;
		Иначе
			Объект.ДатаНачала = Объект.Родитель.ДатаНачала;
		КонецЕсли;
	КонецЕсли;	
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();	
	
	Если Объект.Периодичность = мПериодичность.Год Тогда
		Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		Объект.Наименование = ПредставлениеПериода(НачалоДня(Объект.ДатаНачала), КонецДня(Объект.ДатаОкончания));
		
	ИначеЕсли Объект.Периодичность = мПериодичность.ДевятьМесяцев Тогда
		Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);
		Объект.Наименование = "Девять месяцев " + Формат(Объект.ДатаНачала, "ДФ='гггг ""г.""'");
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		
	ИначеЕсли Объект.Периодичность = мПериодичность.Полугодие Тогда
		Если Объект.ДатаНачала < ДобавитьМесяц(НачалоГода(Объект.ДатаНачала), 6) Тогда
			Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);
			Объект.Наименование = "1 полугодие " + Формат(Объект.ДатаНачала, "ДФ='гггг ""г.""'");
		Иначе 
			Объект.ДатаНачала = ДобавитьМесяц(НачалоГода(Объект.ДатаНачала), 6);
			Объект.Наименование = "2 полугодие " + Формат(Объект.ДатаНачала, "ДФ='гггг ""г.""'");
		КонецЕсли;
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		
	ИначеЕсли Объект.Периодичность = мПериодичность.Квартал Тогда
		Объект.ДатаНачала = НачалоКвартала(Объект.ДатаНачала);
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		Объект.Наименование = ПредставлениеПериода(НачалоДня(Объект.ДатаНачала), КонецДня(Объект.ДатаОкончания));
		
	ИначеЕсли Объект.Периодичность = мПериодичность.Месяц Тогда
		Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		Объект.Наименование = ПредставлениеПериода(НачалоДня(Объект.ДатаНачала), КонецДня(Объект.ДатаОкончания));
		
	ИначеЕсли Объект.Периодичность = мПериодичность.Декада Тогда
		
		Если День(Объект.ДатаНачала) < 10 Тогда
			Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
			Объект.Наименование = "1 декада. " + Формат(Объект.ДатаНачала, "ДФ='ММММ гггг ""г.""'");
		ИначеЕсли День(Объект.ДатаНачала) < 20 Тогда
			Объект.ДатаНачала = ДобавитьДень(НачалоМесяца(Объект.ДатаНачала), 10);
			Объект.Наименование = "2 декада. " + Формат(Объект.ДатаНачала, "ДФ='ММММ гггг ""г.""'");
		Иначе 
			Объект.ДатаНачала = ДобавитьДень(НачалоМесяца(Объект.ДатаНачала), 20);
			Объект.Наименование = "3 декада. " + Формат(Объект.ДатаНачала, "ДФ='ММММ гггг ""г.""'");
		КонецЕсли;
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);

	Иначе
		Объект.ДатаОкончания = ОпределитьДатуОкончания(Объект.Периодичность, Объект.ДатаНачала);
		Объект.Наименование = ПредставлениеПериода(НачалоДня(Объект.ДатаНачала), КонецДня(Объект.ДатаОкончания));
	КонецЕсли;
	
	// Определяем родителя
		
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Периоды.Ссылка,
	|	РАЗНОСТЬДАТ(Периоды.ДатаНачала, Периоды.ДатаОкончания, ДЕНЬ) КАК РазностьДат
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	(НЕ Периоды.Произвольный)
	|	И Периоды.Ссылка <> &Ссылка
	|	И (Периоды.ДатаНачала <= &ДатаНачала
	|				И Периоды.ДатаОкончания > &ДатаОкончания
	|			ИЛИ Периоды.ДатаНачала < &ДатаНачала
	|				И Периоды.ДатаОкончания >= &ДатаОкончания)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазностьДат";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка",			Объект.Ссылка);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда // Есть вышестоящий период
		
		Объект.Родитель=Результат.Ссылка;
		
	КонецЕсли;
		
КонецПроцедуры	

// Определяет список доступных дочерних периодов для заданного родительского
//
Функция ОпределитьДочерниеПериоды(РодительПериодичность) Экспорт
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	ДоступныеЗначения = Новый СписокЗначений;
	ДоступныеЗначения.Добавить(мПериодичность.Год);
	ДоступныеЗначения.Добавить(мПериодичность.ДевятьМесяцев);
	ДоступныеЗначения.Добавить(мПериодичность.Полугодие);
	ДоступныеЗначения.Добавить(мПериодичность.Квартал);
	ДоступныеЗначения.Добавить(мПериодичность.Месяц);
	ДоступныеЗначения.Добавить(мПериодичность.Декада);
	ДоступныеЗначения.Добавить(мПериодичность.День);
	
	ТекущийИндекс = -1;
	МассивРодительских = Новый Массив;
		 
	ТекущееЗначение = ДоступныеЗначения.НайтиПоЗначению(РодительПериодичность);	 
	Если НЕ ТекущееЗначение = Неопределено Тогда
		ТекущийИндекс = ДоступныеЗначения.Индекс(ТекущееЗначение);
	КонецЕсли;
	
	Пока ТекущийИндекс > -1 Цикл
		МассивРодительских.Добавить(ДоступныеЗначения[ТекущийИндекс]);
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	
	Для Каждого РодительскийПериод Из МассивРодительских Цикл
		ДоступныеЗначения.Удалить(РодительскийПериод);
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
		 
КонецФункции	

// Формирует стандартные отчетные периоды за ближайшие года,
// начиная с переданного в параметре ТекущийГод.
//
//  Параметры
//  ТекущийГод - Число(4,0), год, с которого начинать заполнение.
//                            Если не указан - текущий год по дате сеанса.
//  КоличествоЛет - Число(1.0), количество лет формирования периодов.
//  ЗаполняемыеПериоды - Массив, содержит стандартные периоды для заполнения.
//
//
Процедура ЗагрузитьЭлементы(ТекущийГод = 0, КоличествоЛет = 0, ЗаполняемыеПериоды = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КоличествоЛет) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТекущийГод) Тогда
		ТекущийГод = Год(ТекущаяДатаСеанса());
	КонецЕсли;	
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода",Дата(ТекущийГод,1,1));
	Запрос.УстановитьПараметр("ПериодичностьГод",мПериодичность.Год);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Периоды.Ссылка,
	|	Периоды.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала >= &ДатаНачалаГода
	|	И Периоды.Периодичность = &ПериодичностьГод
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Для Сч = 0 По КоличествоЛет - 1 Цикл
		
		ТекДатаНачала = Дата(ТекущийГод + Сч, 1, 1);
		
		Если Выборка.НайтиСледующий(ТекДатаНачала,"ДатаНачала") Тогда
			ПериодГод = Выборка.Ссылка;
		Иначе
			
			ПериодГод = Справочники.Периоды.СоздатьЭлемент();
			ПериодГод.Периодичность = мПериодичность.Год;
			ПериодГод.ДатаНачала = ТекДатаНачала;
			
			ЗаполнитьРеквизитыОбъекта(ПериодГод);
			
			ПериодГод.ОбменДанными.Загрузка = Истина;
			ПериодГод.Записать();
			ПериодГод = ПериодГод.Ссылка;
			
		КонецЕсли;

		СоздатьПериоды(ЗаполняемыеПериоды, ПериодГод);
		РеструктурироватьПериоды(ПериодГод);
	КонецЦикла;

КонецПроцедуры //ЗагрузитьЭлементы()

Функция НайтиСоздатьПериод(Периодичность,ДатаНачала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Периоды.Ссылка
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.ДатаНачала = &ДатаНачала
		|	И Периоды.Периодичность = &Периодичность";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Периодичность", Периодичность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли;
	
	НовыйПериод = Справочники.Периоды.СоздатьЭлемент();
	НовыйПериод.ДатаНачала = ДатаНачала;
	НовыйПериод.Периодичность = Периодичность;
	Справочники.Периоды.ЗаполнитьРеквизитыОбъекта(НовыйПериод);
	НовыйПериод.Записать();
	
	Возврат НовыйПериод.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция выполняет определение даты окончания периода по дате начала и периодичности
//
Функция ОпределитьДатуОкончания(Периодичность, ДатаНачала)
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Если Периодичность = мПериодичность.Год Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 12) - 1);
		
	ИначеЕсли Периодичность = мПериодичность.ДевятьМесяцев Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 9) - 1);
		
	ИначеЕсли Периодичность = мПериодичность.Полугодие Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 6) - 1);
		
	ИначеЕсли Периодичность = мПериодичность.Квартал Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 3) - 1);
		
	ИначеЕсли Периодичность = мПериодичность.Месяц Тогда
		ДатаКонцаПериода = НачалоДня(ДобавитьМесяц(ДатаНачала, 1) - 1);
		
	ИначеЕсли Периодичность = мПериодичность.Декада Тогда
		Если День(ДатаНачала) < 10 Тогда
			ДатаКонцаПериода = ДобавитьДень(ДатаНачала, 10) - 1;
		ИначеЕсли День(ДатаНачала) < 20 Тогда
			ДатаКонцаПериода = ДобавитьДень(ДатаНачала, 10) - 1;
		Иначе 
			ДатаКонцаПериода = КонецМесяца(ДатаНачала);
		КонецЕсли;
		
	Иначе
		ДатаКонцаПериода = ДатаНачала;
		
	КонецЕсли;
		
	Возврат ДатаКонцаПериода;
    
КонецФункции

//Функция добавляет "ЧислоДней" к "Дата"
//
Функция ДобавитьДень(Дата, ЧислоДней)
	
	Возврат Дата + ЧислоДней * 86400; // 86400 = 24*60*60 - число секунд в дне;
	
КонецФункции // ()

#КонецОбласти

#КонецЕсли
